In [1]:
import pandas as pd
people={'first':['Keith','Sharol','Berur'],
        'last':['Korir','Rutto','Koimet'],
        'Email':['KeithKorir@gmail.com', 'SharolRutto@gmail.com','BerurKoimet']
       }

In [2]:
df=pd.DataFrame(people)

In [3]:
df

    first    last                  Email
0   Keith   Korir   KeithKorir@gmail.com
1  Sharol   Rutto  SharolRutto@gmail.com
2   Berur  Koimet            BerurKoimet

In [4]:
df["full_name"]=df['first']+' '+df['last']

In [5]:
df

    first    last                  Email     full_name
0   Keith   Korir   KeithKorir@gmail.com   Keith Korir
1  Sharol   Rutto  SharolRutto@gmail.com  Sharol Rutto
2   Berur  Koimet            BerurKoimet  Berur Koimet

In [6]:
df.drop(columns='full_name') #use inplaece=True to make the changes permanent or df=df.drop(columns='full_name')

    first    last                  Email
0   Keith   Korir   KeithKorir@gmail.com
1  Sharol   Rutto  SharolRutto@gmail.com
2   Berur  Koimet            BerurKoimet

In [7]:
df

    first    last                  Email     full_name
0   Keith   Korir   KeithKorir@gmail.com   Keith Korir
1  Sharol   Rutto  SharolRutto@gmail.com  Sharol Rutto
2   Berur  Koimet            BerurKoimet  Berur Koimet

In [8]:
df.drop(columns=['first','last'], inplace=True) #delete several columns

In [9]:
df

                   Email     full_name
0   KeithKorir@gmail.com   Keith Korir
1  SharolRutto@gmail.com  Sharol Rutto
2            BerurKoimet  Berur Koimet

In [10]:
df['full_name'].str.split(" ",expand=True) #without expend it reurns a list

        0       1
0   Keith   Korir
1  Sharol   Rutto
2   Berur  Koimet

In [11]:
df[['first','last']]=df['full_name'].str.split(" ",expand=True) #split a column to several columns

In [12]:
df

                   Email     full_name   first    last
0   KeithKorir@gmail.com   Keith Korir   Keith   Korir
1  SharolRutto@gmail.com  Sharol Rutto  Sharol   Rutto
2            BerurKoimet  Berur Koimet   Berur  Koimet

In [13]:
df.drop(index=0)

                   Email     full_name   first    last
1  SharolRutto@gmail.com  Sharol Rutto  Sharol   Rutto
2            BerurKoimet  Berur Koimet   Berur  Koimet

In [14]:
df.apply(len)

Email        3
full_name    3
first        3
last         3
dtype: int64

In [15]:
df.apply(len, axis='columns')

0    4
1    4
2    4
dtype: int64

In [16]:
df['first'].str.upper()

0     KEITH
1    SHAROL
2     BERUR
Name: first, dtype: object

In [17]:
df['last'].apply(lambda x: x.upper())

0     KORIR
1     RUTTO
2    KOIMET
Name: last, dtype: object

In [18]:
filt=df['Email']=='KeithKorir@gmail.com'
df.loc[filt,'last']='Barnoty'

In [19]:
df

                   Email     full_name   first     last
0   KeithKorir@gmail.com   Keith Korir   Keith  Barnoty
1  SharolRutto@gmail.com  Sharol Rutto  Sharol    Rutto
2            BerurKoimet  Berur Koimet   Berur   Koimet

In [20]:
df.loc[1,'last']='Jemutai'

In [21]:
df

                   Email     full_name   first     last
0   KeithKorir@gmail.com   Keith Korir   Keith  Barnoty
1  SharolRutto@gmail.com  Sharol Rutto  Sharol  Jemutai
2            BerurKoimet  Berur Koimet   Berur   Koimet

In [22]:
df.columns.str.lower() #convert df to lower temporarily

Index(['email', 'full_name', 'first', 'last'], dtype='object')

In [23]:
df.columns=df.columns.str.lower() #convert df to lower permanently

In [24]:
df

                   email     full_name   first     last
0   KeithKorir@gmail.com   Keith Korir   Keith  Barnoty
1  SharolRutto@gmail.com  Sharol Rutto  Sharol  Jemutai
2            BerurKoimet  Berur Koimet   Berur   Koimet

In [25]:
df.apply(lambda x: x.lower()) #break since apply actions on series & not entire df

AttributeError: 'Series' object has no attribute 'lower'

In [ ]:
df.applymap(str.lower) #or df.applymap(lambda x: x.lower()) #Apply works for entire df

In [26]:
df['last']=df['last'].map({'Barnoty': 'Kiptui', 'Jemutai': 'Ruto'}) # replace more ideal than map #substitute several items

In [27]:
df

                   email     full_name   first    last
0   KeithKorir@gmail.com   Keith Korir   Keith  Kiptui
1  SharolRutto@gmail.com  Sharol Rutto  Sharol    Ruto
2            BerurKoimet  Berur Koimet   Berur     NaN

In [39]:
df['last']=df['last'].replace({'Kiptui': 'Tiondo','NaN':'Koimet'})

In [42]:
filt=df['first']=='Berur'

In [43]:
df[filt]

         email     full_name  first last
2  BerurKoimet  Berur Koimet  Berur  NaN

In [46]:
df.loc[filt,'last']='Korir'

In [47]:
df

                   email     full_name   first    last
0   KeithKorir@gmail.com   Keith Korir   Keith  Tiondo
1  SharolRutto@gmail.com  Sharol Rutto  Sharol    Ruto
2            BerurKoimet  Berur Koimet   Berur   Korir

In [50]:
df['last']=df['last'].replace({'Tiondo':'Koimet'})

In [51]:
df

                   email     full_name   first    last
0   KeithKorir@gmail.com   Keith Korir   Keith  Koimet
1  SharolRutto@gmail.com  Sharol Rutto  Sharol    Ruto
2            BerurKoimet  Berur Koimet   Berur  Koimet

In [52]:
df['last']=df['last'].replace({'Koimet':'korir'}) #replace function

In [57]:
df

                   email     full_name   first   last
0   KeithKorir@gmail.com   Keith Korir   Keith  korir
1  SharolRutto@gmail.com  Sharol Rutto  Sharol   Ruto
2            BerurKoimet  Berur Koimet   Berur  korir

In [63]:
df=df.drop(columns='full_name')

In [64]:
df

                   email   first   last
0   KeithKorir@gmail.com   Keith  korir
1  SharolRutto@gmail.com  Sharol   Ruto
2            BerurKoimet   Berur  korir

In [74]:
df.loc[len(df)]={"first":"Kai", 'last':'Mengich' }      # adding an item to df                                                  
                                                        #df.append({"first":"Kai"})  This append function crushes hence

In [75]:
df

                   email   first     last
0   KeithKorir@gmail.com   Keith    korir
1  SharolRutto@gmail.com  Sharol     Ruto
2            BerurKoimet   Berur    korir
3                    NaN     Kai      NaN
4                    NaN     Kai  Mengich

In [78]:
df.drop(index=3,inplace=True)

In [79]:
df

                   email   first     last
0   KeithKorir@gmail.com   Keith    korir
1  SharolRutto@gmail.com  Sharol     Ruto
2            BerurKoimet   Berur    korir
4                    NaN     Kai  Mengich

In [82]:
filt=df['first']=='Kai' #Update Mengich's email
df.loc[filt]

  email first     last
4   NaN   Kai  Mengich

In [84]:
df.loc[filt,'email']=df.loc[filt,'first']+df.loc[filt,'last']+'@gmail.com'

In [85]:
df

                   email   first     last
0   KeithKorir@gmail.com   Keith    korir
1  SharolRutto@gmail.com  Sharol     Ruto
2            BerurKoimet   Berur    korir
4   KaiMengich@gmail.com     Kai  Mengich

In [93]:
filt2=df['last']=='korir'              #Deleting multiple rows
df.loc[filt2]

                  email  first   last
0  KeithKorir@gmail.com  Keith  korir
2           BerurKoimet  Berur  korir

In [97]:
df.loc[filt2].index                 #Get the indexes of rows to delete

Index([0, 2], dtype='int64')

In [98]:
df.drop(index=df.loc[filt2].index)

                   email   first     last
1  SharolRutto@gmail.com  Sharol     Ruto
4   KaiMengich@gmail.com     Kai  Mengich

In [99]:
df

                   email   first     last
0   KeithKorir@gmail.com   Keith    korir
1  SharolRutto@gmail.com  Sharol     Ruto
2            BerurKoimet   Berur    korir
4   KaiMengich@gmail.com     Kai  Mengich

In [101]:
df.sort_values(by='last', ascending=False) #sorting data

                   email   first     last
0   KeithKorir@gmail.com   Keith    korir
2            BerurKoimet   Berur    korir
1  SharolRutto@gmail.com  Sharol     Ruto
4   KaiMengich@gmail.com     Kai  Mengich

In [106]:
df.sort_values(by=['first','last'],ascending=[True, False], inplace=True) #sorting several criteria and save permaently

                   email   first     last
2            BerurKoimet   Berur    korir
4   KaiMengich@gmail.com     Kai  Mengich
0   KeithKorir@gmail.com   Keith    korir
1  SharolRutto@gmail.com  Sharol     Ruto

In [107]:
df.sort_index() #sort using index

                   email   first     last
0   KeithKorir@gmail.com   Keith    korir
1  SharolRutto@gmail.com  Sharol     Ruto
2            BerurKoimet   Berur    korir
4   KaiMengich@gmail.com     Kai  Mengich

In [110]:
df['last'].sort_values(ascending=False) #sort specific column

0      korir
2      korir
1       Ruto
4    Mengich
Name: last, dtype: object

In [2]:
df['high'].resample('D').mean

In [ ]:
df